; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Freecell is a solitaire game that comes with Windows.
;;; If you haven't seen it before:
;;;  One has 8 columns of cards, 4 freecells and 4 homecells. The
;;;  cards start in "random" (random according to MS's brain damaged RNG)
;;;  piles in the 8 columns. We can move a card in the following ways: 
;;;  1. we can move any card that is on top of a column to an empty free
;;;     cell. The free cells only take one card each.
;;;  2. we can move any card from a free cell or from top of a column to
;;;  a home cell if that home cell contains a card of the same suit
;;;  and is one lower in value (aces have value 1, Jacks 11, Queens
;;;  12, Kings 13), and to make things more symmetric we start the
;;;  homecells off containing "phone" cards with value 0.
;;;  3. we can move any card from the  top of a column or from a
;;;  freecell to the top of another column if that column currently holds
;;;  a card with an opposite colour suit that has one higher
;;;  value. 
;;;  4. we can move any card from a free cell or on top of a column to a
;;;  new column if there are less than 8 columns.
;;; The aim is to get all of the card home. The problems show quite a
;;; good variety of difficulty. 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain freecell)
  (:requirements :strips :typing)
  (:types card colnum cellnum num suit)
  (:predicates (on ?c1 - card ?c2 - card)
	       (incell ?c - card)
	       (clear ?c - card)
	       (cellspace ?n - cellnum)
	       (colspace ?n - colnum)
	       (home ?c - card)
	       (bottomcol ?c - card)
	       (canstack ?c1 - card ?c2 - card)
	       (hassuit ?c - card ?s - suit)
	       (value ?c - card ?v - num)
	       (successor ?n1 - num ?n0 - num)
	       (colsuccessor ?n1 - colnum ?n0 - colnum)
	       (cellsuccessor ?n1 - cellnum ?n0 - cellnum)
 )

;;; Move card between columns. Two versions dependent on whether or
;;; not we generate a new stack.

  (:action move
	   :parameters (?card ?oldcard ?newcard - card)
	   :precondition (and (clear ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (on ?card ?oldcard))
	   :effect (and
		    (on ?card ?newcard)
		    (clear ?oldcard)
		    (not (on ?card ?oldcard))
		    (not (clear ?newcard))))

  (:action move-b
	   :parameters (?card ?newcard - card ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (clear ?newcard)
			      (canstack ?card ?newcard)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and (on ?card ?newcard)
			(colspace ?ncols)
			(not (bottomcol ?card))
			(not (clear ?newcard))
			(not (colspace ?cols))))

;; Send a card to a freecell. Two versions dependent on whether or not
;; we generate a new stack.

  (:action sendtofree
	   :parameters (?card ?oldcard - card ?cells ?ncells - cellnum)
	   :precondition (and
			  (clear ?card)
			  (on ?card ?oldcard)
			  (cellspace ?cells)
			  (cellsuccessor ?cells ?ncells))
	   :effect (and
		    (incell ?card)
		    (clear ?oldcard)
		    (cellspace ?ncells)
		    (not (on ?card ?oldcard))
		    (not (clear ?card))
		    (not (cellspace ?cells))))

  (:action sendtofree-b
	   :parameters (?card - card ?cells ?ncells - cellnum ?cols ?ncols - colnum)
	   :precondition (and (clear ?card)
			      (bottomcol ?card)
			      (cellspace ?cells)
			      (cellsuccessor ?cells ?ncells)
			      (colspace ?cols)
			      (colsuccessor ?ncols ?cols))
	   :effect (and
		    (incell ?card)
		    (colspace ?ncols)
		    (cellspace ?ncells)
		    (not (bottomcol ?card))
		    (not (clear ?card))
		    (not (colspace ?cols))
		    (not (cellspace ?cells))))

;; Send a card a new column

(:action sendtonewcol
	 :parameters (?card ?oldcard - card ?cols ?ncols - colnum)
	 :precondition (and
			(clear ?card)
			(colspace ?cols)
			(colsuccessor ?cols ?ncols)
			(on ?card ?oldcard))
	 :effect (and
		  (bottomcol ?card)
		  (clear ?oldcard)
		  (colspace ?ncols)
		  (not (on ?card ?oldcard))
		  (not (colspace ?cols))))

;;Send a card home

(:action sendtohome
	 :parameters (?card ?oldcard - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num)
	 :precondition (and
			(clear ?card)
			(on ?card ?oldcard)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard))
	 :effect (and (home ?card)
		      (clear ?oldcard)
		      (not (on ?card ?oldcard))
                      (not (home ?homecard))
		      (not (clear ?card))))

(:action sendtohome-b
	 :parameters (?card - card ?suitname - suit  ?vcard - num
			    ?homecard - card
			    ?vhomecard - num
			    ?cols ?ncols - colnum)
	 :precondition (and (clear ?card)
			    (bottomcol ?card)
			    (home ?homecard)
			    (hassuit ?card ?suitname)
			    (hassuit ?homecard ?suitname)
			    (value ?card ?vcard)
			    (value ?homecard ?vhomecard)
			    (successor ?vcard ?vhomecard)
			    (colspace ?cols)
			    (colsuccessor ?ncols ?cols))
	 :effect (and (home ?card)
		      (colspace ?ncols)
		      (not (home ?homecard))
		      (not (clear ?card))
		      (not (bottomcol ?card))
		      (not (colspace ?cols))))

;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Move cards in free cell
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(:action homefromfreecell
	 :parameters (?card - card ?suitname - suit ?vcard - num
			    ?homecard - card ?vhomecard - num
			    ?cells ?ncells - cellnum)
    ;;Send a card home from a free cell.
	 :precondition (and
			(incell ?card)
			(home ?homecard)
			(hassuit ?card ?suitname)
			(hassuit ?homecard ?suitname)
			(value ?card ?vcard)
			(value ?homecard ?vhomecard)
			(successor ?vcard ?vhomecard)
			(cellspace ?cells)
			(cellsuccessor ?ncells ?cells))
	 :effect (and
		  (home ?card)
		  (cellspace ?ncells)
		  (not (incell ?card))
		  (not (cellspace ?cells))
		  (not (home ?homecard))))

(:action colfromfreecell
	 :parameters (?card ?newcard -  card ?cells ?ncells - cellnum)
	 :precondition (and  (incell ?card)
			     (clear ?newcard)
			     (canstack ?card ?newcard)
			     (cellspace ?cells)
			     (cellsuccessor ?ncells ?cells))
	 :effect (and (cellspace ?ncells)
		      (clear ?card)
		      (on ?card ?newcard)
		      (not (incell ?card))
		      (not (cellspace ?cells))
		      (not (clear ?newcard))))

(:action newcolfromfreecell
	 :parameters (?card - card ?cols ?ncols - colnum ?cells ?ncells - cellnum)
	 :precondition (and (incell ?card)
			    (colspace ?cols)
			    (cellspace ?cells)
			    (colsuccessor ?cols ?ncols)
			    (cellsuccessor ?ncells ?cells))
	 :effect (and (bottomcol ?card)
		      (clear ?card)
		      (colspace ?ncols)
		      (cellspace ?ncells)
		      (not (incell ?card))
		      (not (colspace ?cols))
		      (not (cellspace ?cells)))))

; problem
(define (problem freecell-f4-c8-s4-i8-010-110-210-310
)(:domain freecell)
(:objects 
          c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10
          h0 h1 h2 h3 h4 h5 h6 h7 h8 h9 h10
          s0 s1 s2 s3 s4 s5 s6 s7 s8 s9 s10
          d0 d1 d2 d3 d4 d5 d6 d7 d8 d9 d10
 - card
          celln0 celln1 celln2 celln3 celln4 
 - cellnum
          coln0 coln1 coln2 coln3 coln4 coln5 coln6 coln7 coln8 
 - colnum
          n0 n1 n2 n3 n4 n5 n6 n7 n8 n9 n10 
 - num
           c h s d
 - suit
)
(:init
(value c0 n0)
(value c1 n1)
(value c2 n2)
(value c3 n3)
(value c4 n4)
(value c5 n5)
(value c6 n6)
(value c7 n7)
(value c8 n8)
(value c9 n9)
(value c10 n10)
(value h0 n0)
(value h1 n1)
(value h2 n2)
(value h3 n3)
(value h4 n4)
(value h5 n5)
(value h6 n6)
(value h7 n7)
(value h8 n8)
(value h9 n9)
(value h10 n10)
(value s0 n0)
(value s1 n1)
(value s2 n2)
(value s3 n3)
(value s4 n4)
(value s5 n5)
(value s6 n6)
(value s7 n7)
(value s8 n8)
(value s9 n9)
(value s10 n10)
(value d0 n0)
(value d1 n1)
(value d2 n2)
(value d3 n3)
(value d4 n4)
(value d5 n5)
(value d6 n6)
(value d7 n7)
(value d8 n8)
(value d9 n9)
(value d10 n10)
(cellsuccessor celln1 celln0)
(cellsuccessor celln2 celln1)
(cellsuccessor celln3 celln2)
(cellsuccessor celln4 celln3)
(colsuccessor coln1 coln0)
(colsuccessor coln2 coln1)
(colsuccessor coln3 coln2)
(colsuccessor coln4 coln3)
(colsuccessor coln5 coln4)
(colsuccessor coln6 coln5)
(colsuccessor coln7 coln6)
(colsuccessor coln8 coln7)
(successor n1 n0)
(successor n2 n1)
(successor n3 n2)
(successor n4 n3)
(successor n5 n4)
(successor n6 n5)
(successor n7 n6)
(successor n8 n7)
(successor n9 n8)
(successor n10 n9)
(hassuit c0 c)
(hassuit c1 c)
(hassuit c2 c)
(hassuit c3 c)
(hassuit c4 c)
(hassuit c5 c)
(hassuit c6 c)
(hassuit c7 c)
(hassuit c8 c)
(hassuit c9 c)
(hassuit c10 c)
(hassuit h0 h)
(hassuit h1 h)
(hassuit h2 h)
(hassuit h3 h)
(hassuit h4 h)
(hassuit h5 h)
(hassuit h6 h)
(hassuit h7 h)
(hassuit h8 h)
(hassuit h9 h)
(hassuit h10 h)
(hassuit s0 s)
(hassuit s1 s)
(hassuit s2 s)
(hassuit s3 s)
(hassuit s4 s)
(hassuit s5 s)
(hassuit s6 s)
(hassuit s7 s)
(hassuit s8 s)
(hassuit s9 s)
(hassuit s10 s)
(hassuit d0 d)
(hassuit d1 d)
(hassuit d2 d)
(hassuit d3 d)
(hassuit d4 d)
(hassuit d5 d)
(hassuit d6 d)
(hassuit d7 d)
(hassuit d8 d)
(hassuit d9 d)
(hassuit d10 d)
(canstack c2 h3)
(canstack c2 d3)
(canstack c3 h4)
(canstack c3 d4)
(canstack c4 h5)
(canstack c4 d5)
(canstack c5 h6)
(canstack c5 d6)
(canstack c6 h7)
(canstack c6 d7)
(canstack c7 h8)
(canstack c7 d8)
(canstack c8 h9)
(canstack c8 d9)
(canstack c9 h10)
(canstack c9 d10)
(canstack h2 c3)
(canstack h2 s3)
(canstack h3 c4)
(canstack h3 s4)
(canstack h4 c5)
(canstack h4 s5)
(canstack h5 c6)
(canstack h5 s6)
(canstack h6 c7)
(canstack h6 s7)
(canstack h7 c8)
(canstack h7 s8)
(canstack h8 c9)
(canstack h8 s9)
(canstack h9 c10)
(canstack h9 s10)
(canstack s2 h3)
(canstack s2 d3)
(canstack s3 h4)
(canstack s3 d4)
(canstack s4 h5)
(canstack s4 d5)
(canstack s5 h6)
(canstack s5 d6)
(canstack s6 h7)
(canstack s6 d7)
(canstack s7 h8)
(canstack s7 d8)
(canstack s8 h9)
(canstack s8 d9)
(canstack s9 h10)
(canstack s9 d10)
(canstack d2 c3)
(canstack d2 s3)
(canstack d3 c4)
(canstack d3 s4)
(canstack d4 c5)
(canstack d4 s5)
(canstack d5 c6)
(canstack d5 s6)
(canstack d6 c7)
(canstack d6 s7)
(canstack d7 c8)
(canstack d7 s8)
(canstack d8 c9)
(canstack d8 s9)
(canstack d9 c10)
(canstack d9 s10)
(home c0)
(home h0)
(home s0)
(home d0)
(cellspace celln4)
(colspace coln0)

(bottomcol s8)
(on d6 s8)
(on d9 d6)
(on c4 d9)
(clear c4)

(bottomcol c6)
(on c5 c6)
(on c10 c5)
(clear c10)

(bottomcol h4)
(on h6 h4)
(on s9 h6)
(on s3 s9)
(on d10 s3)
(on h5 d10)
(clear h5)

(bottomcol h3)
(on h7 h3)
(on c2 h7)
(on s5 c2)
(on s4 s5)
(on d4 s4)
(on d7 d4)
(clear d7)

(bottomcol d3)
(on h10 d3)
(on c7 h10)
(on c3 c7)
(on h2 c3)
(on h9 h2)
(clear h9)

(bottomcol c8)
(on d8 c8)
(on h8 d8)
(on d5 h8)
(on d2 d5)
(clear d2)

(bottomcol s6)
(on s7 s6)
(on c9 s7)
(on s2 c9)
(on s1 s2)
(clear s1)

(bottomcol d1)
(on h1 d1)
(on c1 h1)
(on s10 c1)
(clear s10)
)
(:goal
(and
(home c10)
(home h10)
(home s10)
(home d10)
)
)
)

; plan
1. (sendtohome s1 s2 s n1 s0 n0)
   deleted: (on s1 s2) (home s0) (clear s1)
   added: (home s1) (clear s2)
   goals met: 0 of 4
2. (sendtohome s2 c9 s n2 s1 n1)
   deleted: (on s2 c9) (home s1) (clear s2)
   added: (home s2) (clear c9)
   goals met: 0 of 4
3. (sendtofree s10 c1 celln4 celln3)
   deleted: (on s10 c1) (clear s10) (cellspace celln4)
   added: (incell s10) (clear c1) (cellspace celln3)
   goals met: 0 of 4
4. (sendtohome c1 h1 c n1 c0 n0)
   deleted: (on c1 h1) (home c0) (clear c1)
   added: (home c1) (clear h1)
   goals met: 0 of 4
5. (sendtohome h1 d1 h n1 h0 n0)
   deleted: (on h1 d1) (home h0) (clear h1)
   added: (home h1) (clear d1)
   goals met: 0 of 4
6. (sendtohome-b d1 d n1 d0 n0 coln0 coln1)
   deleted: (home d0) (clear d1) (bottomcol d1) (colspace coln0)
   added: (home d1) (colspace coln1)
   goals met: 0 of 4
7. (sendtohome d2 d5 d n2 d1 n1)
   deleted: (on d2 d5) (home d1) (clear d2)
   added: (home d2) (clear d5)
   goals met: 0 of 4
8. (sendtofree d7 d4 celln3 celln2)
   deleted: (on d7 d4) (clear d7) (cellspace celln3)
   added: (incell d7) (clear d4) (cellspace celln2)
   goals met: 0 of 4
9. (sendtofree d4 s4 celln2 celln1)
   deleted: (on d4 s4) (clear d4) (cellspace celln2)
   added: (incell d4) (clear s4) (cellspace celln1)
   goals met: 0 of 4
10. (sendtofree h5 d10 celln1 celln0)
   deleted: (on h5 d10) (clear h5) (cellspace celln1)
   added: (incell h5) (clear d10) (cellspace celln0)
   goals met: 0 of 4
11. (sendtonewcol d10 s3 coln1 coln0)
   deleted: (on d10 s3) (colspace coln1)
   added: (bottomcol d10) (clear s3) (colspace coln0)
   goals met: 0 of 4
12. (sendtohome s3 s9 s n3 s2 n2)
   deleted: (on s3 s9) (home s2) (clear s3)
   added: (home s3) (clear s9)
   goals met: 0 of 4
13. (move c4 d9 d5)
   deleted: (on c4 d9) (clear d5)
   added: (on c4 d5) (clear d9)
   goals met: 0 of 4
14. (sendtohome s4 s5 s n4 s3 n3)
   deleted: (on s4 s5) (home s3) (clear s4)
   added: (home s4) (clear s5)
   goals met: 0 of 4
15. (sendtohome s5 c2 s n5 s4 n4)
   deleted: (on s5 c2) (home s4) (clear s5)
   added: (home s5) (clear c2)
   goals met: 0 of 4
16. (sendtohome c2 h7 c n2 c1 n1)
   deleted: (on c2 h7) (home c1) (clear c2)
   added: (home c2) (clear h7)
   goals met: 0 of 4
17. (move c9 s7 d10)
   deleted: (on c9 s7) (clear d10)
   added: (on c9 d10) (clear s7)
   goals met: 0 of 4
18. (move d9 d6 c10)
   deleted: (on d9 d6) (clear c10)
   added: (on d9 c10) (clear d6)
   goals met: 0 of 4
19. (move d6 s8 s7)
   deleted: (on d6 s8) (clear s7)
   added: (on d6 s7) (clear s8)
   goals met: 0 of 4
20. (move-b s8 d9 coln0 coln1)
   deleted: (bottomcol s8) (clear d9) (colspace coln0)
   added: (on s8 d9) (colspace coln1)
   goals met: 0 of 4
21. (move h7 h3 s8)
   deleted: (on h7 h3) (clear s8)
   added: (on h7 s8) (clear h3)
   goals met: 0 of 4
22. (sendtonewcol s9 h6 coln1 coln0)
   deleted: (on s9 h6) (colspace coln1)
   added: (bottomcol s9) (clear h6) (colspace coln0)
   goals met: 0 of 4
23. (move-b h3 c4 coln0 coln1)
   deleted: (bottomcol h3) (clear c4) (colspace coln0)
   added: (on h3 c4) (colspace coln1)
   goals met: 0 of 4
24. (sendtonewcol h9 h2 coln1 coln0)
   deleted: (on h9 h2) (colspace coln1)
   added: (bottomcol h9) (clear h2) (colspace coln0)
   goals met: 0 of 4
25. (sendtohome h2 c3 h n2 h1 n1)
   deleted: (on h2 c3) (home h1) (clear h2)
   added: (home h2) (clear c3)
   goals met: 0 of 4
26. (sendtohome c3 c7 c n3 c2 n2)
   deleted: (on c3 c7) (home c2) (clear c3)
   added: (home c3) (clear c7)
   goals met: 0 of 4
27. (sendtohome h3 c4 h n3 h2 n2)
   deleted: (on h3 c4) (home h2) (clear h3)
   added: (home h3) (clear c4)
   goals met: 0 of 4
28. (sendtohome c4 d5 c n4 c3 n3)
   deleted: (on c4 d5) (home c3) (clear c4)
   added: (home c4) (clear d5)
   goals met: 0 of 4
29. (move h6 h4 c7)
   deleted: (on h6 h4) (clear c7)
   added: (on h6 c7) (clear h4)
   goals met: 0 of 4
30. (sendtohome-b h4 h n4 h3 n3 coln0 coln1)
   deleted: (home h3) (clear h4) (bottomcol h4) (colspace coln0)
   added: (home h4) (colspace coln1)
   goals met: 0 of 4
31. (homefromfreecell h5 h n5 h4 n4 celln0 celln1)
   deleted: (incell h5) (cellspace celln0) (home h4)
   added: (home h5) (cellspace celln1)
   goals met: 0 of 4
32. (sendtohome h6 c7 h n6 h5 n5)
   deleted: (on h6 c7) (home h5) (clear h6)
   added: (home h6) (clear c7)
   goals met: 0 of 4
33. (sendtofree d5 h8 celln1 celln0)
   deleted: (on d5 h8) (clear d5) (cellspace celln1)
   added: (incell d5) (clear h8) (cellspace celln0)
   goals met: 0 of 4
34. (sendtohome h7 s8 h n7 h6 n6)
   deleted: (on h7 s8) (home h6) (clear h7)
   added: (home h7) (clear s8)
   goals met: 0 of 4
35. (sendtohome h8 d8 h n8 h7 n7)
   deleted: (on h8 d8) (home h7) (clear h8)
   added: (home h8) (clear d8)
   goals met: 0 of 4
36. (move d8 c8 c9)
   deleted: (on d8 c8) (clear c9)
   added: (on d8 c9) (clear c8)
   goals met: 0 of 4
37. (move c7 h10 d8)
   deleted: (on c7 h10) (clear d8)
   added: (on c7 d8) (clear h10)
   goals met: 0 of 4
38. (sendtonewcol h10 d3 coln1 coln0)
   deleted: (on h10 d3) (colspace coln1)
   added: (bottomcol h10) (clear d3) (colspace coln0)
   goals met: 0 of 4
39. (sendtohome-b d3 d n3 d2 n2 coln0 coln1)
   deleted: (home d2) (clear d3) (bottomcol d3) (colspace coln0)
   added: (home d3) (colspace coln1)
   goals met: 0 of 4
40. (homefromfreecell d4 d n4 d3 n3 celln0 celln1)
   deleted: (incell d4) (cellspace celln0) (home d3)
   added: (home d4) (cellspace celln1)
   goals met: 0 of 4
41. (homefromfreecell d5 d n5 d4 n4 celln1 celln2)
   deleted: (incell d5) (cellspace celln1) (home d4)
   added: (home d5) (cellspace celln2)
   goals met: 0 of 4
42. (sendtohome d6 s7 d n6 d5 n5)
   deleted: (on d6 s7) (home d5) (clear d6)
   added: (home d6) (clear s7)
   goals met: 0 of 4
43. (sendtofree s7 s6 celln2 celln1)
   deleted: (on s7 s6) (clear s7) (cellspace celln2)
   added: (incell s7) (clear s6) (cellspace celln1)
   goals met: 0 of 4
44. (sendtohome-b s6 s n6 s5 n5 coln1 coln2)
   deleted: (home s5) (clear s6) (bottomcol s6) (colspace coln1)
   added: (home s6) (colspace coln2)
   goals met: 0 of 4
45. (homefromfreecell s7 s n7 s6 n6 celln1 celln2)
   deleted: (incell s7) (cellspace celln1) (home s6)
   added: (home s7) (cellspace celln2)
   goals met: 0 of 4
46. (homefromfreecell d7 d n7 d6 n6 celln2 celln3)
   deleted: (incell d7) (cellspace celln2) (home d6)
   added: (home d7) (cellspace celln3)
   goals met: 0 of 4
47. (sendtohome s8 d9 s n8 s7 n7)
   deleted: (on s8 d9) (home s7) (clear s8)
   added: (home s8) (clear d9)
   goals met: 0 of 4
48. (sendtohome-b s9 s n9 s8 n8 coln2 coln3)
   deleted: (home s8) (clear s9) (bottomcol s9) (colspace coln2)
   added: (home s9) (colspace coln3)
   goals met: 0 of 4
49. (sendtofree c7 d8 celln3 celln2)
   deleted: (on c7 d8) (clear c7) (cellspace celln3)
   added: (incell c7) (clear d8) (cellspace celln2)
   goals met: 0 of 4
50. (sendtohome d8 c9 d n8 d7 n7)
   deleted: (on d8 c9) (home d7) (clear d8)
   added: (home d8) (clear c9)
   goals met: 0 of 4
51. (sendtohome d9 c10 d n9 d8 n8)
   deleted: (on d9 c10) (home d8) (clear d9)
   added: (home d9) (clear c10)
   goals met: 0 of 4
52. (sendtofree c10 c5 celln2 celln1)
   deleted: (on c10 c5) (clear c10) (cellspace celln2)
   added: (incell c10) (clear c5) (cellspace celln1)
   goals met: 0 of 4
53. (sendtohome c5 c6 c n5 c4 n4)
   deleted: (on c5 c6) (home c4) (clear c5)
   added: (home c5) (clear c6)
   goals met: 0 of 4
54. (sendtohome-b c6 c n6 c5 n5 coln3 coln4)
   deleted: (home c5) (clear c6) (bottomcol c6) (colspace coln3)
   added: (home c6) (colspace coln4)
   goals met: 0 of 4
55. (homefromfreecell c7 c n7 c6 n6 celln1 celln2)
   deleted: (incell c7) (cellspace celln1) (home c6)
   added: (home c7) (cellspace celln2)
   goals met: 0 of 4
56. (sendtohome-b c8 c n8 c7 n7 coln4 coln5)
   deleted: (home c7) (clear c8) (bottomcol c8) (colspace coln4)
   added: (home c8) (colspace coln5)
   goals met: 0 of 4
57. (sendtohome c9 d10 c n9 c8 n8)
   deleted: (on c9 d10) (home c8) (clear c9)
   added: (home c9) (clear d10)
   goals met: 0 of 4
58. (sendtohome-b d10 d n10 d9 n9 coln5 coln6)
   deleted: (home d9) (clear d10) (bottomcol d10) (colspace coln5)
   added: (home d10) (colspace coln6)
   goals met: 1 of 4
59. (homefromfreecell s10 s n10 s9 n9 celln2 celln3)
   deleted: (incell s10) (cellspace celln2) (home s9)
   added: (home s10) (cellspace celln3)
   goals met: 2 of 4
60. (sendtohome-b h9 h n9 h8 n8 coln6 coln7)
   deleted: (home h8) (clear h9) (bottomcol h9) (colspace coln6)
   added: (home h9) (colspace coln7)
   goals met: 2 of 4
61. (sendtohome-b h10 h n10 h9 n9 coln7 coln8)
   deleted: (home h9) (clear h10) (bottomcol h10) (colspace coln7)
   added: (home h10) (colspace coln8)
   goals met: 3 of 4
62. (homefromfreecell c10 c n10 c9 n9 celln3 celln4)
   deleted: (incell c10) (cellspace celln3) (home c9)
   added: (home c10) (cellspace celln4)
   goals met: 4 of 4
